[M_UncleTeddy MissionDefinition]
MissionDescription="A girl named Yuna asks for help from her uncle, Teddy, who is still alive. [place]Stone[-place]. Weapon designer Teddy is exiled to Pandora after stealing a weapon designed by Hyperion. If you find evidence that Hyperion stole the patent, Una Pants can sue you. Imagery. "
TurnInDescription="The story of T.K. Baha - Gone but not forgotten."

[M_UncleTeddy:UncleTeddy_FindBluePrint MissionObjectiveDefinition]
ProgressMessage="See T.K."
